a1 = 0b00010101
a2 = 0b00000101
b1 = 0b00111110
b2 = 0b00001001
c1 = 0b00011111
c2 = 0b00000011

a3 = a1 * a2
b3 = b1 * b2
c3 = c1 * c2
print(" Умножение чисел", (format(a1, 'b')), "*" ,(format(a2, 'b')), "=", (format(a3, 'b')), "\n Или",  a1,"+", a2, "=", a3)
print(" Умножение чисел", (format(b1, 'b')), "*" ,(format(b2, 'b')), "=", (format(b3, 'b')), "\n Или",  b1,"+", b2, "=", b3)
print(" Умножение чисел", (format(c1, 'b')), "*" ,(format(c2, 'b')), "=", (format(c3, 'b')), "\n Или",  c1,"+", c2, "=", c3)